; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob83) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate9)
	(at pallet1 distributor0)
	(clear crate8)
	(at pallet2 distributor1)
	(clear crate10)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 343)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 351)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 49)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 32)
	(at crate2 distributor0)
	(on crate2 crate1)
	(= (weight crate2) 59)
	(at crate3 depot0)
	(on crate3 pallet0)
	(= (weight crate3) 3)
	(at crate4 depot0)
	(on crate4 crate3)
	(= (weight crate4) 70)
	(at crate5 depot0)
	(on crate5 crate4)
	(= (weight crate5) 36)
	(at crate6 distributor1)
	(on crate6 crate0)
	(= (weight crate6) 93)
	(at crate7 depot0)
	(on crate7 crate5)
	(= (weight crate7) 15)
	(at crate8 distributor0)
	(on crate8 crate2)
	(= (weight crate8) 79)
	(at crate9 depot0)
	(on crate9 crate7)
	(= (weight crate9) 15)
	(at crate10 distributor1)
	(on crate10 crate6)
	(= (weight crate10) 15)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate3)
		(on crate1 crate6)
		(on crate2 crate9)
		(on crate3 crate5)
		(on crate5 crate8)
		(on crate6 crate10)
		(on crate7 pallet2)
		(on crate8 pallet0)
		(on crate9 pallet1)
		(on crate10 crate7)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist0 crate9 crate7 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate7)
   added: (lifting hoist0 crate9) (clear crate7)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 10
2. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 10
3. (load hoist0 crate9 truck0 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 15
   goals met: 0 of 10
4. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 11 to 21
   goals met: 0 of 10
5. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 15 to 0
   goals met: 0 of 10
6. (lift hoist0 crate7 crate5 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate5)
   added: (lifting hoist0 crate7) (clear crate5)
   changed: (fuel-cost) from 21 to 22
   goals met: 0 of 10
7. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 15
   goals met: 0 of 10
8. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 22 to 32
   goals met: 0 of 10
9. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 15
   goals met: 0 of 10
10. (unload hoist2 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck1) from 15 to 0
   goals met: 0 of 10
11. (lift hoist1 crate8 crate2 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate2)
   added: (lifting hoist1 crate8) (clear crate2)
   changed: (fuel-cost) from 32 to 33
   goals met: 0 of 10
12. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   changed: (current_load truck0) from 15 to 94
   goals met: 0 of 10
13. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 94 to 79
   goals met: 0 of 10
14. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 33 to 43
   goals met: 0 of 10
15. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck0) from 79 to 0
   goals met: 0 of 10
16. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 43 to 53
   goals met: 0 of 10
17. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 15
   goals met: 0 of 10
18. (lift hoist1 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 crate1)
   added: (lifting hoist1 crate2) (clear crate1)
   changed: (fuel-cost) from 53 to 54
   goals met: 0 of 10
19. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   changed: (current_load truck0) from 15 to 74
   goals met: 0 of 10
20. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 54 to 55
   goals met: 0 of 10
21. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 74 to 106
   goals met: 0 of 10
22. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 106 to 91
   goals met: 0 of 10
23. (drop hoist1 crate9 pallet1 distributor0)
   deleted: (lifting hoist1 crate9) (clear pallet1)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 pallet1)
   goals met: 1 of 10
24. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 91 to 32
   goals met: 1 of 10
25. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 55 to 65
   goals met: 1 of 10
26. (drop hoist1 crate2 crate9 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate9)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate9)
   goals met: 2 of 10
27. (load hoist2 crate7 truck1 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 15
   goals met: 2 of 10
28. (lift hoist2 crate10 crate6 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate6)
   added: (lifting hoist2 crate10) (clear crate6)
   changed: (fuel-cost) from 65 to 66
   goals met: 2 of 10
29. (load hoist2 crate10 truck0 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   changed: (current_load truck0) from 32 to 47
   goals met: 2 of 10
30. (unload hoist2 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck1) from 15 to 0
   goals met: 2 of 10
31. (drop hoist2 crate7 crate6 distributor1)
   deleted: (lifting hoist2 crate7) (clear crate6)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 crate6)
   goals met: 2 of 10
32. (unload hoist2 crate10 truck0 distributor1)
   deleted: (in crate10 truck0) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck0) from 47 to 32
   goals met: 2 of 10
33. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 66 to 76
   goals met: 2 of 10
34. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   changed: (current_load truck0) from 32 to 111
   goals met: 2 of 10
35. (lift hoist0 crate5 crate4 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate4)
   added: (lifting hoist0 crate5) (clear crate4)
   changed: (fuel-cost) from 76 to 77
   goals met: 2 of 10
36. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 111 to 147
   goals met: 2 of 10
37. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck0) from 147 to 68
   goals met: 2 of 10
38. (drop hoist0 crate8 crate4 depot0)
   deleted: (lifting hoist0 crate8) (clear crate4)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate4)
   goals met: 2 of 10
39. (lift hoist0 crate8 crate4 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate4)
   added: (lifting hoist0 crate8) (clear crate4)
   changed: (fuel-cost) from 77 to 78
   goals met: 2 of 10
40. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   changed: (current_load truck0) from 68 to 147
   goals met: 2 of 10
41. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   changed: (fuel-cost) from 78 to 79
   goals met: 2 of 10
42. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   changed: (current_load truck0) from 147 to 217
   goals met: 2 of 10
43. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck0) from 217 to 138
   goals met: 2 of 10
44. (drop hoist0 crate8 crate3 depot0)
   deleted: (lifting hoist0 crate8) (clear crate3)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 crate3)
   goals met: 2 of 10
45. (lift hoist0 crate8 crate3 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate3)
   added: (lifting hoist0 crate8) (clear crate3)
   changed: (fuel-cost) from 79 to 80
   goals met: 2 of 10
46. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   changed: (current_load truck0) from 138 to 217
   goals met: 2 of 10
47. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   changed: (fuel-cost) from 80 to 81
   goals met: 2 of 10
48. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 217 to 220
   goals met: 2 of 10
49. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck0) from 220 to 141
   goals met: 2 of 10
50. (drop hoist0 crate8 pallet0 depot0)
   deleted: (lifting hoist0 crate8) (clear pallet0)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 pallet0)
   goals met: 3 of 10
51. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck0) from 141 to 105
   goals met: 3 of 10
52. (drop hoist0 crate5 crate8 depot0)
   deleted: (lifting hoist0 crate5) (clear crate8)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate8)
   goals met: 4 of 10
53. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 81 to 91
   goals met: 4 of 10
54. (load hoist2 crate10 truck1 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 15
   goals met: 4 of 10
55. (lift hoist2 crate7 crate6 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate6)
   added: (lifting hoist2 crate7) (clear crate6)
   changed: (fuel-cost) from 91 to 92
   goals met: 4 of 10
56. (load hoist2 crate7 truck1 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   changed: (current_load truck1) from 15 to 30
   goals met: 4 of 10
57. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 105 to 73
   goals met: 4 of 10
58. (drop hoist2 crate1 crate6 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate6)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate6)
   goals met: 5 of 10
59. (unload hoist2 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck1) from 30 to 15
   goals met: 5 of 10
60. (drop hoist2 crate7 crate1 distributor1)
   deleted: (lifting hoist2 crate7) (clear crate1)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 crate1)
   goals met: 5 of 10
61. (lift hoist2 crate7 crate1 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate1)
   added: (lifting hoist2 crate7) (clear crate1)
   changed: (fuel-cost) from 92 to 93
   goals met: 5 of 10
62. (load hoist2 crate7 truck1 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   changed: (current_load truck1) from 15 to 30
   goals met: 5 of 10
63. (lift hoist2 crate1 crate6 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 crate6)
   added: (lifting hoist2 crate1) (clear crate6)
   changed: (fuel-cost) from 93 to 94
   goals met: 4 of 10
64. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 30 to 62
   goals met: 4 of 10
65. (lift hoist2 crate6 crate0 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate0)
   added: (lifting hoist2 crate6) (clear crate0)
   changed: (fuel-cost) from 94 to 95
   goals met: 4 of 10
66. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 62 to 155
   goals met: 4 of 10
67. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 95 to 96
   goals met: 4 of 10
68. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 73 to 122
   goals met: 4 of 10
69. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 96 to 106
   goals met: 4 of 10
70. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck0) from 122 to 119
   goals met: 4 of 10
71. (drop hoist0 crate3 crate5 depot0)
   deleted: (lifting hoist0 crate3) (clear crate5)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate5)
   goals met: 5 of 10
72. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 119 to 70
   goals met: 5 of 10
73. (drop hoist0 crate0 crate3 depot0)
   deleted: (lifting hoist0 crate0) (clear crate3)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate3)
   goals met: 6 of 10
74. (unload hoist2 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck1) from 155 to 140
   goals met: 6 of 10
75. (drop hoist2 crate7 pallet2 distributor1)
   deleted: (lifting hoist2 crate7) (clear pallet2)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 pallet2)
   goals met: 7 of 10
76. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 140 to 47
   goals met: 7 of 10
77. (drop hoist2 crate6 crate7 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate7)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate7)
   goals met: 7 of 10
78. (lift hoist2 crate6 crate7 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate7)
   added: (lifting hoist2 crate6) (clear crate7)
   changed: (fuel-cost) from 106 to 107
   goals met: 7 of 10
79. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 47 to 140
   goals met: 7 of 10
80. (unload hoist2 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck1) from 140 to 125
   goals met: 7 of 10
81. (drop hoist2 crate10 crate7 distributor1)
   deleted: (lifting hoist2 crate10) (clear crate7)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 crate7)
   goals met: 8 of 10
82. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 125 to 32
   goals met: 8 of 10
83. (drop hoist2 crate6 crate10 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate10)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate10)
   goals met: 9 of 10
84. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 32 to 0
   goals met: 9 of 10
85. (drop hoist2 crate1 crate6 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate6)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate6)
   goals met: 10 of 10
